#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.cloudflare_ip_ranges.main: Reading...
data.cloudflare_account.main: Reading...
data.cloudflare_ip_ranges.main: Read complete after 0s
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
data.oci_containerengine_cluster_option.main: Reading...
oci_identity_compartment.main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
data.oci_core_services.all_services: Reading...
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
data.oci_identity_availability_domains.main: Reading...
oci_budget_budget.main: Refreshing state... [id=ocid1.budget.oc1.ap-seoul-1.amaaaaaabsyhd7qa2wpumdq7peealllchr7ao5lcpkldzdgzgq7qoij4x2yq]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
data.cloudflare_account.main: Read complete after 1s [id=ec0cbb953bed382efecdedb2fadea7c4]
cloudflare_zone.main: Refreshing state... [id=17ad56810b60da50d4fc69f477b6e3fd]
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_identity_fault_domains.main: Reading...
oci_ons_notification_topic.main: Refreshing state... [id=ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
data.oci_core_images.ubuntu: Reading...
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
oci_logging_log_group.main: Refreshing state... [id=ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda]
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
oci_artifacts_container_repository.application: Refreshing state... [id=ocid1.containerrepo.oc1.ap-seoul-1.0.cnm7patunz1z.aaaaaaaa7rlpcolbbhe2tqr3r4tokxl4wizslzh4pryinxffib4wdq3mzhma]
cloudflare_zone_setting.ssl-mode: Refreshing state... [id=ssl]
cloudflare_zone_setting.security-level: Refreshing state... [id=security_level]
cloudflare_zone_setting.secure-mode: Refreshing state... [id=always_use_https]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
cloudflare_zone_setting.tls-version: Refreshing state... [id=min_tls_version]
oci_budget_alert_rule.main: Refreshing state... [id=ocid1.alertrule.oc1.ap-seoul-1.amaaaaaabsyhd7qajb44qwouyva4scc7ygfqdopoxjihlhbakqyetfr2wv2q]
oci_identity_auth_token.application: Refreshing state... [id=ocid1.credential.oc1..aaaaaaaad6ed2wnvwb7pqj6mipgcodcurwrqz35u2elduhntp72r7yemi6ea]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_network_security_group.load-balancer: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-675692870]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
cloudflare_dns_record.monitor: Refreshing state... [id=8623234b3a1886a7ee026519eae943e6]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_monitoring_alarm.instance-cpu: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6qx5fjp34nevhtdeneyqhjzt43stjxvzy6jip2gpcs6a]
oci_monitoring_alarm.instance-memory: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qas5de7mmyekowv2zsbw2oxqz6pjwpqa5awsttqhtf4o2q]
oci_ons_subscription.email: Refreshing state... [id=ocid1.onssubscription.oc1.ap-seoul-1.aaaaaaaaaarkzfrko5jnvzkbpad3c5fojdswzzu3u47ffxiisu4agl4rqwzq]
oci_core_network_security_group_security_rule.load-balancer-to-global: Refreshing state... [id=93E16C]
oci_core_network_security_group_security_rule.load-balancer-from-http: Refreshing state... [id=840F75]
oci_core_network_security_group_security_rule.load-balancer-from-https: Refreshing state... [id=270C2F]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.worker-from-load-balancer: Refreshing state... [id=03EBBF]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_logging_log.subnet-public: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca]
oci_load_balancer_load_balancer.main: Refreshing state... [id=ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
oci_logging_log.subnet-private: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qalejvdxip7gkcra4rcyqknkchnfumj4j766annytvv4ba]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_logging_log.load-balancer-error: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qa4ivpk7sbgrflajkzqxalmnmk47atcb3pbsnpl56y3i5a]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
oci_monitoring_alarm.load-balancer-bandwidth: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qaezb57s4mvb346pdiwznadug6uc4canyzrmt6qyjqkptq]
oci_logging_log.load-balancer-access: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qawlujhtxaxz4drs7i4tojl4l5akflvqjsodbcghcz2nvq]
oci_monitoring_alarm.load-balancer-health: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6bqigwre2ojntewig34hro6ggiddynjzbln4pkm6uoaa]
data.oci_containerengine_cluster_kube_config.main: Reading...
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_cluster_kube_config.main: Read complete after 0s [id=ContainerengineClusterKubeConfigDataSource-3656204518]
kubernetes_namespace_v1.main: Refreshing state... [id=main]
kubernetes_priority_class_v1.system: Refreshing state... [id=priority-system]
kubernetes_namespace_v1.dev: Refreshing state... [id=dev]
kubernetes_priority_class_v1.main: Refreshing state... [id=priority-main]
kubernetes_priority_class_v1.dev: Refreshing state... [id=priority-dev]
kubernetes_namespace_v1.system: Refreshing state... [id=system]
data.oci_containerengine_node_pool_option.main: Read complete after 1s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]
kubernetes_limit_range_v1.main: Refreshing state... [id=main/limit-main]
kubernetes_resource_quota_v1.main: Refreshing state... [id=main/quota-main]
kubernetes_resource_quota_v1.system: Refreshing state... [id=system/quota-system]
kubernetes_limit_range_v1.system: Refreshing state... [id=system/limit-system]
kubernetes_ingress_v1.monitor: Refreshing state... [id=system/ingress-monitor]
helm_release.controller: Refreshing state... [id=controller]
helm_release.monitor: Refreshing state... [id=monitor]
kubernetes_limit_range_v1.dev: Refreshing state... [id=dev/limit-dev]
kubernetes_resource_quota_v1.dev: Refreshing state... [id=dev/quota-dev]
kubernetes_deployment_v1.application-dev: Refreshing state... [id=dev/application-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_load_balancer_backend_set.main will be created
  + resource "oci_load_balancer_backend_set" "main" {
      + backend                 = (known after apply)
      + backend_max_connections = (known after apply)
      + id                      = (known after apply)
      + load_balancer_id        = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"
      + name                    = "platform-backend-set"
      + policy                  = "ROUND_ROBIN"
      + state                   = (known after apply)

      + health_checker {
          + interval_ms         = 30000
          + is_force_plain_text = (known after apply)
          + port                = 0
          + protocol            = "TCP"
          + response_body_regex = (known after apply)
          + retries             = 3
          + return_code         = (known after apply)
          + timeout_in_millis   = 3000
          + url_path            = (known after apply)
        }

      + lb_cookie_session_persistence_configuration (known after apply)

      + session_persistence_configuration (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*